org-mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
  <head>
    <!-- 2020-09-20 dom 22:23 -->
    <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <title>&lrm;</title>
    <meta name="generator" content="Org mode" />
    <meta name="author" content="emiliano" />
  </head>
  <body>
    <div id="content">
      <div id="table-of-contents">
        <h2>Table of Contents</h2>
        <div id="text-table-of-contents">
          <ul>
            <li><a href="#orged0af19">1. org-mode</a>
              <ul>
                <li><a href="#orgaba7340">1.1. Integración</a></li>
                <li><a href="#org05e056f">1.2. Registro de problemas distribuido</a></li>
                <li><a href="#org940a055">1.3. Enlaces externos</a></li>
              </ul>
            </li>
          </ul>
        </div>
      </div>
      <div id="outline-container-orged0af19" class="outline-2">
        <h2 id="orged0af19"><span class="section-number-2">1</span> org-mode</h2>
        <div class="outline-text-2" id="text-1">
          <p>
            El modo Org (Org-mode) es un modo de edición del editor de texto Emacs mediante el cual se editan documentos jerárquicos en texto plano.
          </p>

          <p>
            Su uso encaja con distintas necesidades, como la creación de notas de cosas por hacer, la planificación de proyectos y hasta la escritura de páginas web. Por ejemplo, los elementos to-do (cosas por hacer) pueden disponer de prioridades y fechas de vencimiento, pueden estar subdivididos en subtareas o en listas de verificación, y pueden etiquetarse o dársele propiedades. También puede generarse automáticamente una agenda de las entradas de cosas por hacer.1​
          </p>

          <p>
            La mayor parte del comportamiento del modo Org puede personalizarse mediante los procedimientos habituales en Emacs (es decir estableciendo directamente el valor de las variables o utilizando la interfaz Customize, más amigable para los usuarios).
          </p>

          <p>
            Desde la versión 22 de Emacs, el modo Org es parte de su distribución oficial2​ - aunque también dispone de entregas separadas, con lo que las versiones más recientes del modo Org con respecto a la que se incluye en Emacs también están disponibles. 
          </p>
        </div>


        <div id="outline-container-orgaba7340" class="outline-3">
          <h3 id="orgaba7340"><span class="section-number-3">1.1</span> Integración</h3>
          <div class="outline-text-3" id="text-1-1">
            <p>
              El modo Org se puede integrar con
            </p>

            <ul class="org-ul">
              <li>La BBDB de Emacs para enlazar con los detalles de contactos del usuario.</li>
              <li>Navegadores Web como Firefox, para seguir URL.</li>
              <li>El modo Remember para la toma rápida de notas e ideas, pensamientos o enlaces, y después editarlas, categorizarlas o ficharlas adecuadamente.</li>
              <li>Los clientes de correo y noticias de Emacs, tales como Gnus, VM y Wanderlust, para enlazar con mensajes de correo o de noticias.</li>
              <li>El teléfono móvil o celular a través de MobileOrg para:
                <ul class="org-ul">
                  <li>Iphone/Ipod <a href="https://web.archive.org/web/20100323140800/http://mobileorg.ncogni.to/">https://web.archive.org/web/20100323140800/http://mobileorg.ncogni.to/</a> y</li>
                  <li>Los teléfonos basados en Android <a href="https://web.archive.org/web/20100204115729/http://wiki.github.com/matburt/mobileorg-android/">https://web.archive.org/web/20100204115729/http://wiki.github.com/matburt/mobileorg-android/</a></li>
              </ul></li>
            </ul>

            <p>
              También se puede usar para editar esquemas en ficheros que no sean .org.
            </p>

            <p>
              (Algunas de las integraciones citadas requieren extensiones de terceros para el modo Org, siendo todas ellas Software Libre.) 
            </p>
          </div>
        </div>

        <div id="outline-container-org05e056f" class="outline-3">
          <h3 id="org05e056f"><span class="section-number-3">1.2</span> Registro de problemas distribuido</h3>
          <div class="outline-text-3" id="text-1-2">
            <p>
              El modo Org se puede usar como un sistema distribuido de registro de problemas o fallos, si se almacenan los ficheros .org en un sistema de control de revisiones distribuido. Los desarrolladores de la extensión org-babel usan el modo Org de esta manera para registrar los informes de fallos y las solicitudes de características.
            </p>
          </div>
        </div>

        <div id="outline-container-org940a055" class="outline-3">
          <h3 id="org940a055"><span class="section-number-3">1.3</span> Enlaces externos</h3>
          <div class="outline-text-3" id="text-1-3">
            <ul class="org-ul">
              <li><a href="https://www.orgmode.org/">Sitio web del modo Org</a>, básicamente en inglés</li>
              <li><a href="https://orgmode.org/worg/index.html">Lista de guías de texto y vídeo acerca del modo Org</a> en el wiki del sitio, Worg, básicamente en inglés</li>
            </ul>
          </div>
        </div>
      </div>
    </div>
    <div id="postamble" class="status">
      <p class="author">Author: emiliano</p>
      <p class="date">Created: 2020-09-20 dom 22:23</p>
      <p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
    </div>
  </body>
</html>
